#### IsValidCircuitNamingSchemeId Method

---

|  |
| --- |
| CircuitNamingSchemeSettings Class   See Also |

Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static bool IsValidCircuitNamingSchemeId( 	Document aDocument, 	ElementId circuitNamingSchemeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidCircuitNamingSchemeId ( _ 	aDocument As Document, _ 	circuitNamingSchemeId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidCircuitNamingSchemeId( 	Document^ aDocument,  	ElementId^ circuitNamingSchemeId ) ``` |

#### Parameters

aDocument
:   Type:  Autodesk.Revit.DB Document
     The document.

circuitNamingSchemeId
:   Type:  Autodesk.Revit.DB ElementId
     The circuit naming scheme id to be checked.

#### Return Value

True if the circuit naming scheme id is valid for CircuitNamingSchemeSettings.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

CircuitNamingSchemeSettings Class

Autodesk.Revit.DB.Electrical Namespace